RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18.h
/* CONTROL Bit Fields */
#define USBHSDCD_CONTROL_IACK_MASK               0x1u
#define USBHSDCD_CONTROL_IACK_SHIFT              0
#define USBHSDCD_CONTROL_IACK_WIDTH              1
#define USBHSDCD_CONTROL_IACK(x)                 (((uint32_t)(((uint32_t)(x))<<USBHSDCD_CONTROL_IACK_SHIFT))&USBHSDCD_CONTROL_IACK_MASK)
#define USBHSDCD_CONTROL_IF_MASK                 0x100u
#define USBHSDCD_CONTROL_IF_SHIFT                8
#define USBHSDCD_CONTROL_IF_WIDTH                1
#define USBHSDCD_CONTROL_IF(x)                   (((uint32_t)(((uint32_t)(x))<<USBHSDCD_CONTROL_IF_SHIFT))&USBHSDCD_CONTROL_IF_MASK)
#define USBHSDCD_CONTROL_IE_MASK                 0x10000u
#define USBHSDCD_CONTROL_IE_SHIFT                16
#define USBHSDCD_CONTROL_IE_WIDTH                1
#define USBHSDCD_CONTROL_IE(x)                   (((uint32_t)(((uint32_t)(x))<<USBHSDCD_CONTROL_IE_SHIFT))&USBHSDCD_CONTROL_IE_MASK)
#define USBHSDCD_CONTROL_BC12_MASK               0x20000u
#define USBHSDCD_CONTROL_BC12_SHIFT              17
#define USBHSDCD_CONTROL_BC12_WIDTH              1
#define USBHSDCD_CONTROL_BC12(x)                 (((uint32_t)(((uint32_t)(x))<<USBHSDCD_CONTROL_BC12_SHIFT))&USBHSDCD_CONTROL_BC12_MASK)
#define USBHSDCD_CONTROL_START_MASK              0x1000000u
#define USBHSDCD_CONTROL_START_SHIFT             24
#define USBHSDCD_CONTROL_START_WIDTH             1
#define USBHSDCD_CONTROL_START(x)                (((uint32_t)(((uint32_t)(x))<<USBHSDCD_CONTROL_START_SHIFT))&USBHSDCD_CONTROL_START_MASK)
#define USBHSDCD_CONTROL_SR_MASK                 0x2000000u
#define USBHSDCD_CONTROL_SR_SHIFT                25
#define USBHSDCD_CONTROL_SR_WIDTH                1
#define USBHSDCD_CONTROL_SR(x)                   (((uint32_t)(((uint32_t)(x))<<USBHSDCD_CONTROL_SR_SHIFT))&USBHSDCD_CONTROL_SR_MASK)
/* CLOCK Bit Fields */
#define USBHSDCD_CLOCK_CLOCK_UNIT_MASK           0x1u
#define USBHSDCD_CLOCK_CLOCK_UNIT_SHIFT          0
#define USBHSDCD_CLOCK_CLOCK_UNIT_WIDTH          1
#define USBHSDCD_CLOCK_CLOCK_UNIT(x)             (((uint32_t)(((uint32_t)(x))<<USBHSDCD_CLOCK_CLOCK_UNIT_SHIFT))&USBHSDCD_CLOCK_CLOCK_UNIT_MASK)
#define USBHSDCD_CLOCK_CLOCK_SPEED_MASK          0xFFCu
#define USBHSDCD_CLOCK_CLOCK_SPEED_SHIFT         2
#define USBHSDCD_CLOCK_CLOCK_SPEED_WIDTH         10
#define USBHSDCD_CLOCK_CLOCK_SPEED(x)            (((uint32_t)(((uint32_t)(x))<<USBHSDCD_CLOCK_CLOCK_SPEED_SHIFT))&USBHSDCD_CLOCK_CLOCK_SPEED_MASK)
/* STATUS Bit Fields */
#define USBHSDCD_STATUS_SEQ_RES_MASK             0x30000u
#define USBHSDCD_STATUS_SEQ_RES_SHIFT            16
#define USBHSDCD_STATUS_SEQ_RES_WIDTH            2
#define USBHSDCD_STATUS_SEQ_RES(x)               (((uint32_t)(((uint32_t)(x))<<USBHSDCD_STATUS_SEQ_RES_SHIFT))&USBHSDCD_STATUS_SEQ_RES_MASK)
#define USBHSDCD_STATUS_SEQ_STAT_MASK            0xC0000u
#define USBHSDCD_STATUS_SEQ_STAT_SHIFT           18
#define USBHSDCD_STATUS_SEQ_STAT_WIDTH           2
#define USBHSDCD_STATUS_SEQ_STAT(x)              (((uint32_t)(((uint32_t)(x))<<USBHSDCD_STATUS_SEQ_STAT_SHIFT))&USBHSDCD_STATUS_SEQ_STAT_MASK)
#define USBHSDCD_STATUS_ERR_MASK                 0x100000u
#define USBHSDCD_STATUS_ERR_SHIFT                20
#define USBHSDCD_STATUS_ERR_WIDTH                1
#define USBHSDCD_STATUS_ERR(x)                   (((uint32_t)(((uint32_t)(x))<<USBHSDCD_STATUS_ERR_SHIFT))&USBHSDCD_STATUS_ERR_MASK)
#define USBHSDCD_STATUS_TO_MASK                  0x200000u
#define USBHSDCD_STATUS_TO_SHIFT                 21
#define USBHSDCD_STATUS_TO_WIDTH                 1
#define USBHSDCD_STATUS_TO(x)                    (((uint32_t)(((uint32_t)(x))<<USBHSDCD_STATUS_TO_SHIFT))&USBHSDCD_STATUS_TO_MASK)
#define USBHSDCD_STATUS_ACTIVE_MASK              0x400000u
#define USBHSDCD_STATUS_ACTIVE_SHIFT             22
#define USBHSDCD_STATUS_ACTIVE_WIDTH             1
#define USBHSDCD_STATUS_ACTIVE(x)                (((uint32_t)(((uint32_t)(x))<<USBHSDCD_STATUS_ACTIVE_SHIFT))&USBHSDCD_STATUS_ACTIVE_MASK)
/* SIGNAL_OVERRIDE Bit Fields */
#define USBHSDCD_SIGNAL_OVERRIDE_PS_MASK         0x3u
#define USBHSDCD_SIGNAL_OVERRIDE_PS_SHIFT        0
#define USBHSDCD_SIGNAL_OVERRIDE_PS_WIDTH        2
#define USBHSDCD_SIGNAL_OVERRIDE_PS(x)           (((uint32_t)(((uint32_t)(x))<<USBHSDCD_SIGNAL_OVERRIDE_PS_SHIFT))&USBHSDCD_SIGNAL_OVERRIDE_PS_MASK)
/* TIMER0 Bit Fields */
#define USBHSDCD_TIMER0_TUNITCON_MASK            0xFFFu
#define USBHSDCD_TIMER0_TUNITCON_SHIFT           0
#define USBHSDCD_TIMER0_TUNITCON_WIDTH           12
#define USBHSDCD_TIMER0_TUNITCON(x)              (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER0_TUNITCON_SHIFT))&USBHSDCD_TIMER0_TUNITCON_MASK)
#define USBHSDCD_TIMER0_TSEQ_INIT_MASK           0x3FF0000u
#define USBHSDCD_TIMER0_TSEQ_INIT_SHIFT          16
#define USBHSDCD_TIMER0_TSEQ_INIT_WIDTH          10
#define USBHSDCD_TIMER0_TSEQ_INIT(x)             (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER0_TSEQ_INIT_SHIFT))&USBHSDCD_TIMER0_TSEQ_INIT_MASK)
/* TIMER1 Bit Fields */
#define USBHSDCD_TIMER1_TVDPSRC_ON_MASK          0x3FFu
#define USBHSDCD_TIMER1_TVDPSRC_ON_SHIFT         0
#define USBHSDCD_TIMER1_TVDPSRC_ON_WIDTH         10
#define USBHSDCD_TIMER1_TVDPSRC_ON(x)            (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER1_TVDPSRC_ON_SHIFT))&USBHSDCD_TIMER1_TVDPSRC_ON_MASK)
#define USBHSDCD_TIMER1_TDCD_DBNC_MASK           0x3FF0000u
#define USBHSDCD_TIMER1_TDCD_DBNC_SHIFT          16
#define USBHSDCD_TIMER1_TDCD_DBNC_WIDTH          10
#define USBHSDCD_TIMER1_TDCD_DBNC(x)             (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER1_TDCD_DBNC_SHIFT))&USBHSDCD_TIMER1_TDCD_DBNC_MASK)
/* TIMER2_BC11 Bit Fields */
#define USBHSDCD_TIMER2_BC11_CHECK_DM_MASK       0xFu
#define USBHSDCD_TIMER2_BC11_CHECK_DM_SHIFT      0
#define USBHSDCD_TIMER2_BC11_CHECK_DM_WIDTH      4
#define USBHSDCD_TIMER2_BC11_CHECK_DM(x)         (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER2_BC11_CHECK_DM_SHIFT))&USBHSDCD_TIMER2_BC11_CHECK_DM_MASK)
#define USBHSDCD_TIMER2_BC11_TVDPSRC_CON_MASK    0x3FF0000u
#define USBHSDCD_TIMER2_BC11_TVDPSRC_CON_SHIFT   16
#define USBHSDCD_TIMER2_BC11_TVDPSRC_CON_WIDTH   10
#define USBHSDCD_TIMER2_BC11_TVDPSRC_CON(x)      (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER2_BC11_TVDPSRC_CON_SHIFT))&USBHSDCD_TIMER2_BC11_TVDPSRC_CON_MASK)
/* TIMER2_BC12 Bit Fields */
#define USBHSDCD_TIMER2_BC12_TVDMSRC_ON_MASK     0x3FFu
#define USBHSDCD_TIMER2_BC12_TVDMSRC_ON_SHIFT    0
#define USBHSDCD_TIMER2_BC12_TVDMSRC_ON_WIDTH    10
#define USBHSDCD_TIMER2_BC12_TVDMSRC_ON(x)       (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER2_BC12_TVDMSRC_ON_SHIFT))&USBHSDCD_TIMER2_BC12_TVDMSRC_ON_MASK)
#define USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD_MASK 0x3FF0000u
#define USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD_SHIFT 16
#define USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD_WIDTH 10
#define USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD(x)  (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD_SHIFT))&USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD_MASK)

/*!
 * @}
 */ /* end of group USBHSDCD_Register_Masks */


/* USBHSDCD - Peripheral instance base addresses */
/** Peripheral USBHSDCD base address */
#define USBHSDCD_BASE                            (0x400A3000u)
/** Peripheral USBHSDCD base pointer */
#define USBHSDCD                                 ((USBHSDCD_Type *)USBHSDCD_BASE)
#define USBHSDCD_BASE_PTR                        (USBHSDCD)
/** Array initializer of USBHSDCD peripheral base addresses */
#define USBHSDCD_BASE_ADDRS                      { USBHSDCD_BASE }
/** Array initializer of USBHSDCD peripheral base pointers */
#define USBHSDCD_BASE_PTRS                       { USBHSDCD }
/** Interrupt vectors for the USBHSDCD peripheral type */
#define USBHSDCD_IRQS                            { USBHSDCD_IRQn }

/* ----------------------------------------------------------------------------
   -- USBHSDCD - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBHSDCD_Register_Accessor_Macros USBHSDCD - Register accessor macros
 * @{
 */


/* USBHSDCD - Register instance definitions */
/* USBHSDCD */
#define USBHSDCD_CONTROL                         USBHSDCD_CONTROL_REG(USBHSDCD)
#define USBHSDCD_CLOCK                           USBHSDCD_CLOCK_REG(USBHSDCD)
#define USBHSDCD_STATUS                          USBHSDCD_STATUS_REG(USBHSDCD)
#define USBHSDCD_SIGNAL_OVERRIDE                 USBHSDCD_SIGNAL_OVERRIDE_REG(USBHSDCD)
#define USBHSDCD_TIMER0                          USBHSDCD_TIMER0_REG(USBHSDCD)
#define USBHSDCD_TIMER1                          USBHSDCD_TIMER1_REG(USBHSDCD)
#define USBHSDCD_TIMER2_BC11                     USBHSDCD_TIMER2_BC11_REG(USBHSDCD)
#define USBHSDCD_TIMER2_BC12                     USBHSDCD_TIMER2_BC12_REG(USBHSDCD)

/*!
 * @}
 */ /* end of group USBHSDCD_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group USBHSDCD_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- USBPHY Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBPHY_Peripheral_Access_Layer USBPHY Peripheral Access Layer
 * @{
 */

/** USBPHY - Register Layout Typedef */
typedef struct {
  __IO uint32_t PWD;                               /**< USB PHY Power-Down Register, offset: 0x0 */
  __IO uint32_t PWD_SET;                           /**< USB PHY Power-Down Register, offset: 0x4 */
  __IO uint32_t PWD_CLR;                           /**< USB PHY Power-Down Register, offset: 0x8 */
  __IO uint32_t PWD_TOG;                           /**< USB PHY Power-Down Register, offset: 0xC */
  __IO uint32_t TX;                                /**< USB PHY Transmitter Control Register, offset: 0x10 */
  __IO uint32_t TX_SET;                            /**< USB PHY Transmitter Control Register, offset: 0x14 */
  __IO uint32_t TX_CLR;                            /**< USB PHY Transmitter Control Register, offset: 0x18 */
  __IO uint32_t TX_TOG;                            /**< USB PHY Transmitter Control Register, offset: 0x1C */
  __IO uint32_t RX;                                /**< USB PHY Receiver Control Register, offset: 0x20 */
  __IO uint32_t RX_SET;                            /**< USB PHY Receiver Control Register, offset: 0x24 */
  __IO uint32_t RX_CLR;                            /**< USB PHY Receiver Control Register, offset: 0x28 */
  __IO uint32_t RX_TOG;                            /**< USB PHY Receiver Control Register, offset: 0x2C */
  __IO uint32_t CTRL;                              /**< USB PHY General Control Register, offset: 0x30 */
  __IO uint32_t CTRL_SET;                          /**< USB PHY General Control Register, offset: 0x34 */
  __IO uint32_t CTRL_CLR;                          /**< USB PHY General Control Register, offset: 0x38 */
  __IO uint32_t CTRL_TOG;                          /**< USB PHY General Control Register, offset: 0x3C */
  __IO uint32_t STATUS;                            /**< USB PHY Status Register, offset: 0x40 */
       uint8_t RESERVED_0[12];
  __IO uint32_t DEBUGr;                            /**< USB PHY Debug Register, offset: 0x50 */
  __IO uint32_t DEBUG_SET;                         /**< USB PHY Debug Register, offset: 0x54 */
  __IO uint32_t DEBUG_CLR;                         /**< USB PHY Debug Register, offset: 0x58 */
  __IO uint32_t DEBUG_TOG;                         /**< USB PHY Debug Register, offset: 0x5C */
  __I  uint32_t DEBUG0_STATUS;                     /**< UTMI Debug Status Register 0, offset: 0x60 */
       uint8_t RESERVED_1[12];
  __IO uint32_t DEBUG1;                            /**< UTMI Debug Status Register 1, offset: 0x70 */
  __IO uint32_t DEBUG1_SET;                        /**< UTMI Debug Status Register 1, offset: 0x74 */
  __IO uint32_t DEBUG1_CLR;                        /**< UTMI Debug Status Register 1, offset: 0x78 */
  __IO uint32_t DEBUG1_TOG;                        /**< UTMI Debug Status Register 1, offset: 0x7C */
  __I  uint32_t VERSION;                           /**< UTMI RTL Version, offset: 0x80 */
       uint8_t RESERVED_2[28];
  __IO uint32_t PLL_SIC;                           /**< USB PHY PLL Control/Status Register, offset: 0xA0 */
  __IO uint32_t PLL_SIC_SET;                       /**< USB PHY PLL Control/Status Register, offset: 0xA4 */
  __IO uint32_t PLL_SIC_CLR;                       /**< USB PHY PLL Control/Status Register, offset: 0xA8 */
  __IO uint32_t PLL_SIC_TOG;                       /**< USB PHY PLL Control/Status Register, offset: 0xAC */
       uint8_t RESERVED_3[16];
  __IO uint32_t USB1_VBUS_DETECT;                  /**< USB PHY VBUS Detect Control Register, offset: 0xC0 */
  __IO uint32_t USB1_VBUS_DETECT_SET;              /**< USB PHY VBUS Detect Control Register, offset: 0xC4 */
  __IO uint32_t USB1_VBUS_DETECT_CLR;              /**< USB PHY VBUS Detect Control Register, offset: 0xC8 */
  __IO uint32_t USB1_VBUS_DETECT_TOG;              /**< USB PHY VBUS Detect Control Register, offset: 0xCC */
  __I  uint32_t USB1_VBUS_DET_STAT;                /**< USB PHY VBUS Detector Status Register, offset: 0xD0 */
       uint8_t RESERVED_4[28];
  __I  uint32_t USB1_CHRG_DET_STAT;                /**< USB PHY Charger Detect Status Register, offset: 0xF0 */
       uint8_t RESERVED_5[12];
  __IO uint32_t ANACTRL;                           /**< USB PHY Analog Control Register, offset: 0x100 */
  __IO uint32_t ANACTRL_SET;                       /**< USB PHY Analog Control Register, offset: 0x104 */
  __IO uint32_t ANACTRL_CLR;                       /**< USB PHY Analog Control Register, offset: 0x108 */
  __IO uint32_t ANACTRL_TOG;                       /**< USB PHY Analog Control Register, offset: 0x10C */
  __IO uint32_t USB1_LOOPBACK;                     /**< USB PHY Loopback Control/Status Register, offset: 0x110 */
  __IO uint32_t USB1_LOOPBACK_SET;                 /**< USB PHY Loopback Control/Status Register, offset: 0x114 */
  __IO uint32_t USB1_LOOPBACK_CLR;                 /**< USB PHY Loopback Control/Status Register, offset: 0x118 */
  __IO uint32_t USB1_LOOPBACK_TOG;                 /**< USB PHY Loopback Control/Status Register, offset: 0x11C */
  __IO uint32_t USB1_LOOPBACK_HSFSCNT;             /**< USB PHY Loopback Packet Number Select Register, offset: 0x120 */
  __IO uint32_t USB1_LOOPBACK_HSFSCNT_SET;         /**< USB PHY Loopback Packet Number Select Register, offset: 0x124 */
  __IO uint32_t USB1_LOOPBACK_HSFSCNT_CLR;         /**< USB PHY Loopback Packet Number Select Register, offset: 0x128 */
  __IO uint32_t USB1_LOOPBACK_HSFSCNT_TOG;         /**< USB PHY Loopback Packet Number Select Register, offset: 0x12C */
  __IO uint32_t TRIM_OVERRIDE_EN;                  /**< USB PHY Trim Override Enable Register, offset: 0x130 */
  __IO uint32_t TRIM_OVERRIDE_EN_SET;              /**< USB PHY Trim Override Enable Register, offset: 0x134 */
  __IO uint32_t TRIM_OVERRIDE_EN_CLR;              /**< USB PHY Trim Override Enable Register, offset: 0x138 */
  __IO uint32_t TRIM_OVERRIDE_EN_TOG;              /**< USB PHY Trim Override Enable Register, offset: 0x13C */
} USBPHY_Type, *USBPHY_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- USBPHY - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBPHY_Register_Accessor_Macros USBPHY - Register accessor macros
 * @{
 */


