RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18.h
#define USBPHY_DEBUG_SET_HOST_RESUME_DEBUG(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_SET_HOST_RESUME_DEBUG_SHIFT))&USBPHY_DEBUG_SET_HOST_RESUME_DEBUG_MASK)
#define USBPHY_DEBUG_SET_CLKGATE_MASK            0x40000000u
#define USBPHY_DEBUG_SET_CLKGATE_SHIFT           30
#define USBPHY_DEBUG_SET_CLKGATE_WIDTH           1
#define USBPHY_DEBUG_SET_CLKGATE(x)              (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_SET_CLKGATE_SHIFT))&USBPHY_DEBUG_SET_CLKGATE_MASK)
/* DEBUG_CLR Bit Fields */
#define USBPHY_DEBUG_CLR_OTGIDPIOLOCK_MASK       0x1u
#define USBPHY_DEBUG_CLR_OTGIDPIOLOCK_SHIFT      0
#define USBPHY_DEBUG_CLR_OTGIDPIOLOCK_WIDTH      1
#define USBPHY_DEBUG_CLR_OTGIDPIOLOCK(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_OTGIDPIOLOCK_SHIFT))&USBPHY_DEBUG_CLR_OTGIDPIOLOCK_MASK)
#define USBPHY_DEBUG_CLR_DEBUG_INTERFACE_HOLD_MASK 0x2u
#define USBPHY_DEBUG_CLR_DEBUG_INTERFACE_HOLD_SHIFT 1
#define USBPHY_DEBUG_CLR_DEBUG_INTERFACE_HOLD_WIDTH 1
#define USBPHY_DEBUG_CLR_DEBUG_INTERFACE_HOLD(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_DEBUG_INTERFACE_HOLD_SHIFT))&USBPHY_DEBUG_CLR_DEBUG_INTERFACE_HOLD_MASK)
#define USBPHY_DEBUG_CLR_HSTPULLDOWN_MASK        0xCu
#define USBPHY_DEBUG_CLR_HSTPULLDOWN_SHIFT       2
#define USBPHY_DEBUG_CLR_HSTPULLDOWN_WIDTH       2
#define USBPHY_DEBUG_CLR_HSTPULLDOWN(x)          (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_HSTPULLDOWN_SHIFT))&USBPHY_DEBUG_CLR_HSTPULLDOWN_MASK)
#define USBPHY_DEBUG_CLR_ENHSTPULLDOWN_MASK      0x30u
#define USBPHY_DEBUG_CLR_ENHSTPULLDOWN_SHIFT     4
#define USBPHY_DEBUG_CLR_ENHSTPULLDOWN_WIDTH     2
#define USBPHY_DEBUG_CLR_ENHSTPULLDOWN(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_ENHSTPULLDOWN_SHIFT))&USBPHY_DEBUG_CLR_ENHSTPULLDOWN_MASK)
#define USBPHY_DEBUG_CLR_TX2RXCOUNT_MASK         0xF00u
#define USBPHY_DEBUG_CLR_TX2RXCOUNT_SHIFT        8
#define USBPHY_DEBUG_CLR_TX2RXCOUNT_WIDTH        4
#define USBPHY_DEBUG_CLR_TX2RXCOUNT(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_TX2RXCOUNT_SHIFT))&USBPHY_DEBUG_CLR_TX2RXCOUNT_MASK)
#define USBPHY_DEBUG_CLR_ENTX2RXCOUNT_MASK       0x1000u
#define USBPHY_DEBUG_CLR_ENTX2RXCOUNT_SHIFT      12
#define USBPHY_DEBUG_CLR_ENTX2RXCOUNT_WIDTH      1
#define USBPHY_DEBUG_CLR_ENTX2RXCOUNT(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_ENTX2RXCOUNT_SHIFT))&USBPHY_DEBUG_CLR_ENTX2RXCOUNT_MASK)
#define USBPHY_DEBUG_CLR_SQUELCHRESETCOUNT_MASK  0x1F0000u
#define USBPHY_DEBUG_CLR_SQUELCHRESETCOUNT_SHIFT 16
#define USBPHY_DEBUG_CLR_SQUELCHRESETCOUNT_WIDTH 5
#define USBPHY_DEBUG_CLR_SQUELCHRESETCOUNT(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_SQUELCHRESETCOUNT_SHIFT))&USBPHY_DEBUG_CLR_SQUELCHRESETCOUNT_MASK)
#define USBPHY_DEBUG_CLR_ENSQUELCHRESET_MASK     0x1000000u
#define USBPHY_DEBUG_CLR_ENSQUELCHRESET_SHIFT    24
#define USBPHY_DEBUG_CLR_ENSQUELCHRESET_WIDTH    1
#define USBPHY_DEBUG_CLR_ENSQUELCHRESET(x)       (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_ENSQUELCHRESET_SHIFT))&USBPHY_DEBUG_CLR_ENSQUELCHRESET_MASK)
#define USBPHY_DEBUG_CLR_SQUELCHRESETLENGTH_MASK 0x1E000000u
#define USBPHY_DEBUG_CLR_SQUELCHRESETLENGTH_SHIFT 25
#define USBPHY_DEBUG_CLR_SQUELCHRESETLENGTH_WIDTH 4
#define USBPHY_DEBUG_CLR_SQUELCHRESETLENGTH(x)   (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_SQUELCHRESETLENGTH_SHIFT))&USBPHY_DEBUG_CLR_SQUELCHRESETLENGTH_MASK)
#define USBPHY_DEBUG_CLR_HOST_RESUME_DEBUG_MASK  0x20000000u
#define USBPHY_DEBUG_CLR_HOST_RESUME_DEBUG_SHIFT 29
#define USBPHY_DEBUG_CLR_HOST_RESUME_DEBUG_WIDTH 1
#define USBPHY_DEBUG_CLR_HOST_RESUME_DEBUG(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_HOST_RESUME_DEBUG_SHIFT))&USBPHY_DEBUG_CLR_HOST_RESUME_DEBUG_MASK)
#define USBPHY_DEBUG_CLR_CLKGATE_MASK            0x40000000u
#define USBPHY_DEBUG_CLR_CLKGATE_SHIFT           30
#define USBPHY_DEBUG_CLR_CLKGATE_WIDTH           1
#define USBPHY_DEBUG_CLR_CLKGATE(x)              (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_CLKGATE_SHIFT))&USBPHY_DEBUG_CLR_CLKGATE_MASK)
/* DEBUG_TOG Bit Fields */
#define USBPHY_DEBUG_TOG_OTGIDPIOLOCK_MASK       0x1u
#define USBPHY_DEBUG_TOG_OTGIDPIOLOCK_SHIFT      0
#define USBPHY_DEBUG_TOG_OTGIDPIOLOCK_WIDTH      1
#define USBPHY_DEBUG_TOG_OTGIDPIOLOCK(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_OTGIDPIOLOCK_SHIFT))&USBPHY_DEBUG_TOG_OTGIDPIOLOCK_MASK)
#define USBPHY_DEBUG_TOG_DEBUG_INTERFACE_HOLD_MASK 0x2u
#define USBPHY_DEBUG_TOG_DEBUG_INTERFACE_HOLD_SHIFT 1
#define USBPHY_DEBUG_TOG_DEBUG_INTERFACE_HOLD_WIDTH 1
#define USBPHY_DEBUG_TOG_DEBUG_INTERFACE_HOLD(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_DEBUG_INTERFACE_HOLD_SHIFT))&USBPHY_DEBUG_TOG_DEBUG_INTERFACE_HOLD_MASK)
#define USBPHY_DEBUG_TOG_HSTPULLDOWN_MASK        0xCu
#define USBPHY_DEBUG_TOG_HSTPULLDOWN_SHIFT       2
#define USBPHY_DEBUG_TOG_HSTPULLDOWN_WIDTH       2
#define USBPHY_DEBUG_TOG_HSTPULLDOWN(x)          (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_HSTPULLDOWN_SHIFT))&USBPHY_DEBUG_TOG_HSTPULLDOWN_MASK)
#define USBPHY_DEBUG_TOG_ENHSTPULLDOWN_MASK      0x30u
#define USBPHY_DEBUG_TOG_ENHSTPULLDOWN_SHIFT     4
#define USBPHY_DEBUG_TOG_ENHSTPULLDOWN_WIDTH     2
#define USBPHY_DEBUG_TOG_ENHSTPULLDOWN(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_ENHSTPULLDOWN_SHIFT))&USBPHY_DEBUG_TOG_ENHSTPULLDOWN_MASK)
#define USBPHY_DEBUG_TOG_TX2RXCOUNT_MASK         0xF00u
#define USBPHY_DEBUG_TOG_TX2RXCOUNT_SHIFT        8
#define USBPHY_DEBUG_TOG_TX2RXCOUNT_WIDTH        4
#define USBPHY_DEBUG_TOG_TX2RXCOUNT(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_TX2RXCOUNT_SHIFT))&USBPHY_DEBUG_TOG_TX2RXCOUNT_MASK)
#define USBPHY_DEBUG_TOG_ENTX2RXCOUNT_MASK       0x1000u
#define USBPHY_DEBUG_TOG_ENTX2RXCOUNT_SHIFT      12
#define USBPHY_DEBUG_TOG_ENTX2RXCOUNT_WIDTH      1
#define USBPHY_DEBUG_TOG_ENTX2RXCOUNT(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_ENTX2RXCOUNT_SHIFT))&USBPHY_DEBUG_TOG_ENTX2RXCOUNT_MASK)
#define USBPHY_DEBUG_TOG_SQUELCHRESETCOUNT_MASK  0x1F0000u
#define USBPHY_DEBUG_TOG_SQUELCHRESETCOUNT_SHIFT 16
#define USBPHY_DEBUG_TOG_SQUELCHRESETCOUNT_WIDTH 5
#define USBPHY_DEBUG_TOG_SQUELCHRESETCOUNT(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_SQUELCHRESETCOUNT_SHIFT))&USBPHY_DEBUG_TOG_SQUELCHRESETCOUNT_MASK)
#define USBPHY_DEBUG_TOG_ENSQUELCHRESET_MASK     0x1000000u
#define USBPHY_DEBUG_TOG_ENSQUELCHRESET_SHIFT    24
#define USBPHY_DEBUG_TOG_ENSQUELCHRESET_WIDTH    1
#define USBPHY_DEBUG_TOG_ENSQUELCHRESET(x)       (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_ENSQUELCHRESET_SHIFT))&USBPHY_DEBUG_TOG_ENSQUELCHRESET_MASK)
#define USBPHY_DEBUG_TOG_SQUELCHRESETLENGTH_MASK 0x1E000000u
#define USBPHY_DEBUG_TOG_SQUELCHRESETLENGTH_SHIFT 25
#define USBPHY_DEBUG_TOG_SQUELCHRESETLENGTH_WIDTH 4
#define USBPHY_DEBUG_TOG_SQUELCHRESETLENGTH(x)   (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_SQUELCHRESETLENGTH_SHIFT))&USBPHY_DEBUG_TOG_SQUELCHRESETLENGTH_MASK)
#define USBPHY_DEBUG_TOG_HOST_RESUME_DEBUG_MASK  0x20000000u
#define USBPHY_DEBUG_TOG_HOST_RESUME_DEBUG_SHIFT 29
#define USBPHY_DEBUG_TOG_HOST_RESUME_DEBUG_WIDTH 1
#define USBPHY_DEBUG_TOG_HOST_RESUME_DEBUG(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_HOST_RESUME_DEBUG_SHIFT))&USBPHY_DEBUG_TOG_HOST_RESUME_DEBUG_MASK)
#define USBPHY_DEBUG_TOG_CLKGATE_MASK            0x40000000u
#define USBPHY_DEBUG_TOG_CLKGATE_SHIFT           30
#define USBPHY_DEBUG_TOG_CLKGATE_WIDTH           1
#define USBPHY_DEBUG_TOG_CLKGATE(x)              (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_CLKGATE_SHIFT))&USBPHY_DEBUG_TOG_CLKGATE_MASK)
/* DEBUG0_STATUS Bit Fields */
#define USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_MASK 0xFFFFu
#define USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_SHIFT 0
#define USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_WIDTH 16
#define USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_SHIFT))&USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_MASK)
#define USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_MASK 0x3FF0000u
#define USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_SHIFT 16
#define USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_WIDTH 10
#define USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_SHIFT))&USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_MASK)
#define USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_MASK  0xFC000000u
#define USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_SHIFT 26
#define USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_WIDTH 6
#define USBPHY_DEBUG0_STATUS_SQUELCH_COUNT(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_SHIFT))&USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_MASK)
/* DEBUG1 Bit Fields */
#define USBPHY_DEBUG1_ENTAILADJVD_MASK           0x6000u
#define USBPHY_DEBUG1_ENTAILADJVD_SHIFT          13
#define USBPHY_DEBUG1_ENTAILADJVD_WIDTH          2
#define USBPHY_DEBUG1_ENTAILADJVD(x)             (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG1_ENTAILADJVD_SHIFT))&USBPHY_DEBUG1_ENTAILADJVD_MASK)
/* DEBUG1_SET Bit Fields */
#define USBPHY_DEBUG1_SET_ENTAILADJVD_MASK       0x6000u
#define USBPHY_DEBUG1_SET_ENTAILADJVD_SHIFT      13
#define USBPHY_DEBUG1_SET_ENTAILADJVD_WIDTH      2
#define USBPHY_DEBUG1_SET_ENTAILADJVD(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG1_SET_ENTAILADJVD_SHIFT))&USBPHY_DEBUG1_SET_ENTAILADJVD_MASK)
/* DEBUG1_CLR Bit Fields */
#define USBPHY_DEBUG1_CLR_ENTAILADJVD_MASK       0x6000u
#define USBPHY_DEBUG1_CLR_ENTAILADJVD_SHIFT      13
#define USBPHY_DEBUG1_CLR_ENTAILADJVD_WIDTH      2
#define USBPHY_DEBUG1_CLR_ENTAILADJVD(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG1_CLR_ENTAILADJVD_SHIFT))&USBPHY_DEBUG1_CLR_ENTAILADJVD_MASK)
/* DEBUG1_TOG Bit Fields */
#define USBPHY_DEBUG1_TOG_ENTAILADJVD_MASK       0x6000u
#define USBPHY_DEBUG1_TOG_ENTAILADJVD_SHIFT      13
#define USBPHY_DEBUG1_TOG_ENTAILADJVD_WIDTH      2
#define USBPHY_DEBUG1_TOG_ENTAILADJVD(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG1_TOG_ENTAILADJVD_SHIFT))&USBPHY_DEBUG1_TOG_ENTAILADJVD_MASK)
/* VERSION Bit Fields */
#define USBPHY_VERSION_STEP_MASK                 0xFFFFu
#define USBPHY_VERSION_STEP_SHIFT                0
#define USBPHY_VERSION_STEP_WIDTH                16
#define USBPHY_VERSION_STEP(x)                   (((uint32_t)(((uint32_t)(x))<<USBPHY_VERSION_STEP_SHIFT))&USBPHY_VERSION_STEP_MASK)
#define USBPHY_VERSION_MINOR_MASK                0xFF0000u
#define USBPHY_VERSION_MINOR_SHIFT               16
#define USBPHY_VERSION_MINOR_WIDTH               8
#define USBPHY_VERSION_MINOR(x)                  (((uint32_t)(((uint32_t)(x))<<USBPHY_VERSION_MINOR_SHIFT))&USBPHY_VERSION_MINOR_MASK)
#define USBPHY_VERSION_MAJOR_MASK                0xFF000000u
#define USBPHY_VERSION_MAJOR_SHIFT               24
#define USBPHY_VERSION_MAJOR_WIDTH               8
#define USBPHY_VERSION_MAJOR(x)                  (((uint32_t)(((uint32_t)(x))<<USBPHY_VERSION_MAJOR_SHIFT))&USBPHY_VERSION_MAJOR_MASK)
/* PLL_SIC Bit Fields */
#define USBPHY_PLL_SIC_PLL_DIV_SEL_MASK          0x3u
#define USBPHY_PLL_SIC_PLL_DIV_SEL_SHIFT         0
#define USBPHY_PLL_SIC_PLL_DIV_SEL_WIDTH         2
#define USBPHY_PLL_SIC_PLL_DIV_SEL(x)            (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_PLL_DIV_SEL_SHIFT))&USBPHY_PLL_SIC_PLL_DIV_SEL_MASK)
#define USBPHY_PLL_SIC_PLL_EN_USB_CLKS_MASK      0x40u
#define USBPHY_PLL_SIC_PLL_EN_USB_CLKS_SHIFT     6
#define USBPHY_PLL_SIC_PLL_EN_USB_CLKS_WIDTH     1
#define USBPHY_PLL_SIC_PLL_EN_USB_CLKS(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_PLL_EN_USB_CLKS_SHIFT))&USBPHY_PLL_SIC_PLL_EN_USB_CLKS_MASK)
#define USBPHY_PLL_SIC_PLL_HOLD_RING_OFF_MASK    0x800u
#define USBPHY_PLL_SIC_PLL_HOLD_RING_OFF_SHIFT   11
#define USBPHY_PLL_SIC_PLL_HOLD_RING_OFF_WIDTH   1
#define USBPHY_PLL_SIC_PLL_HOLD_RING_OFF(x)      (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_PLL_HOLD_RING_OFF_SHIFT))&USBPHY_PLL_SIC_PLL_HOLD_RING_OFF_MASK)
#define USBPHY_PLL_SIC_PLL_POWER_MASK            0x1000u
#define USBPHY_PLL_SIC_PLL_POWER_SHIFT           12
#define USBPHY_PLL_SIC_PLL_POWER_WIDTH           1
#define USBPHY_PLL_SIC_PLL_POWER(x)              (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_PLL_POWER_SHIFT))&USBPHY_PLL_SIC_PLL_POWER_MASK)
#define USBPHY_PLL_SIC_PLL_ENABLE_MASK           0x2000u
#define USBPHY_PLL_SIC_PLL_ENABLE_SHIFT          13
#define USBPHY_PLL_SIC_PLL_ENABLE_WIDTH          1
#define USBPHY_PLL_SIC_PLL_ENABLE(x)             (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_PLL_ENABLE_SHIFT))&USBPHY_PLL_SIC_PLL_ENABLE_MASK)
#define USBPHY_PLL_SIC_PLL_BYPASS_MASK           0x10000u
#define USBPHY_PLL_SIC_PLL_BYPASS_SHIFT          16
#define USBPHY_PLL_SIC_PLL_BYPASS_WIDTH          1
#define USBPHY_PLL_SIC_PLL_BYPASS(x)             (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_PLL_BYPASS_SHIFT))&USBPHY_PLL_SIC_PLL_BYPASS_MASK)
#define USBPHY_PLL_SIC_PLL_LOCK_MASK             0x80000000u
#define USBPHY_PLL_SIC_PLL_LOCK_SHIFT            31
#define USBPHY_PLL_SIC_PLL_LOCK_WIDTH            1
#define USBPHY_PLL_SIC_PLL_LOCK(x)               (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_PLL_LOCK_SHIFT))&USBPHY_PLL_SIC_PLL_LOCK_MASK)
/* PLL_SIC_SET Bit Fields */
#define USBPHY_PLL_SIC_SET_PLL_DIV_SEL_MASK      0x3u
#define USBPHY_PLL_SIC_SET_PLL_DIV_SEL_SHIFT     0
#define USBPHY_PLL_SIC_SET_PLL_DIV_SEL_WIDTH     2
#define USBPHY_PLL_SIC_SET_PLL_DIV_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_SET_PLL_DIV_SEL_SHIFT))&USBPHY_PLL_SIC_SET_PLL_DIV_SEL_MASK)
#define USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS_MASK  0x40u
#define USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS_SHIFT 6
#define USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS_WIDTH 1
#define USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS_SHIFT))&USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS_MASK)
#define USBPHY_PLL_SIC_SET_PLL_HOLD_RING_OFF_MASK 0x800u
#define USBPHY_PLL_SIC_SET_PLL_HOLD_RING_OFF_SHIFT 11
#define USBPHY_PLL_SIC_SET_PLL_HOLD_RING_OFF_WIDTH 1
#define USBPHY_PLL_SIC_SET_PLL_HOLD_RING_OFF(x)  (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_SET_PLL_HOLD_RING_OFF_SHIFT))&USBPHY_PLL_SIC_SET_PLL_HOLD_RING_OFF_MASK)
#define USBPHY_PLL_SIC_SET_PLL_POWER_MASK        0x1000u
#define USBPHY_PLL_SIC_SET_PLL_POWER_SHIFT       12
#define USBPHY_PLL_SIC_SET_PLL_POWER_WIDTH       1
#define USBPHY_PLL_SIC_SET_PLL_POWER(x)          (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_SET_PLL_POWER_SHIFT))&USBPHY_PLL_SIC_SET_PLL_POWER_MASK)
#define USBPHY_PLL_SIC_SET_PLL_ENABLE_MASK       0x2000u
#define USBPHY_PLL_SIC_SET_PLL_ENABLE_SHIFT      13
#define USBPHY_PLL_SIC_SET_PLL_ENABLE_WIDTH      1
#define USBPHY_PLL_SIC_SET_PLL_ENABLE(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_SET_PLL_ENABLE_SHIFT))&USBPHY_PLL_SIC_SET_PLL_ENABLE_MASK)
#define USBPHY_PLL_SIC_SET_PLL_BYPASS_MASK       0x10000u
#define USBPHY_PLL_SIC_SET_PLL_BYPASS_SHIFT      16
#define USBPHY_PLL_SIC_SET_PLL_BYPASS_WIDTH      1
#define USBPHY_PLL_SIC_SET_PLL_BYPASS(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_SET_PLL_BYPASS_SHIFT))&USBPHY_PLL_SIC_SET_PLL_BYPASS_MASK)
#define USBPHY_PLL_SIC_SET_PLL_LOCK_MASK         0x80000000u
#define USBPHY_PLL_SIC_SET_PLL_LOCK_SHIFT        31
#define USBPHY_PLL_SIC_SET_PLL_LOCK_WIDTH        1
#define USBPHY_PLL_SIC_SET_PLL_LOCK(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_SET_PLL_LOCK_SHIFT))&USBPHY_PLL_SIC_SET_PLL_LOCK_MASK)
/* PLL_SIC_CLR Bit Fields */
#define USBPHY_PLL_SIC_CLR_PLL_DIV_SEL_MASK      0x3u
#define USBPHY_PLL_SIC_CLR_PLL_DIV_SEL_SHIFT     0
#define USBPHY_PLL_SIC_CLR_PLL_DIV_SEL_WIDTH     2
#define USBPHY_PLL_SIC_CLR_PLL_DIV_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_CLR_PLL_DIV_SEL_SHIFT))&USBPHY_PLL_SIC_CLR_PLL_DIV_SEL_MASK)
#define USBPHY_PLL_SIC_CLR_PLL_EN_USB_CLKS_MASK  0x40u
#define USBPHY_PLL_SIC_CLR_PLL_EN_USB_CLKS_SHIFT 6
#define USBPHY_PLL_SIC_CLR_PLL_EN_USB_CLKS_WIDTH 1
#define USBPHY_PLL_SIC_CLR_PLL_EN_USB_CLKS(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_CLR_PLL_EN_USB_CLKS_SHIFT))&USBPHY_PLL_SIC_CLR_PLL_EN_USB_CLKS_MASK)
#define USBPHY_PLL_SIC_CLR_PLL_HOLD_RING_OFF_MASK 0x800u
#define USBPHY_PLL_SIC_CLR_PLL_HOLD_RING_OFF_SHIFT 11
#define USBPHY_PLL_SIC_CLR_PLL_HOLD_RING_OFF_WIDTH 1
#define USBPHY_PLL_SIC_CLR_PLL_HOLD_RING_OFF(x)  (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_CLR_PLL_HOLD_RING_OFF_SHIFT))&USBPHY_PLL_SIC_CLR_PLL_HOLD_RING_OFF_MASK)
#define USBPHY_PLL_SIC_CLR_PLL_POWER_MASK        0x1000u
#define USBPHY_PLL_SIC_CLR_PLL_POWER_SHIFT       12
#define USBPHY_PLL_SIC_CLR_PLL_POWER_WIDTH       1
#define USBPHY_PLL_SIC_CLR_PLL_POWER(x)          (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_CLR_PLL_POWER_SHIFT))&USBPHY_PLL_SIC_CLR_PLL_POWER_MASK)
#define USBPHY_PLL_SIC_CLR_PLL_ENABLE_MASK       0x2000u
#define USBPHY_PLL_SIC_CLR_PLL_ENABLE_SHIFT      13
#define USBPHY_PLL_SIC_CLR_PLL_ENABLE_WIDTH      1
#define USBPHY_PLL_SIC_CLR_PLL_ENABLE(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_CLR_PLL_ENABLE_SHIFT))&USBPHY_PLL_SIC_CLR_PLL_ENABLE_MASK)
#define USBPHY_PLL_SIC_CLR_PLL_BYPASS_MASK       0x10000u
#define USBPHY_PLL_SIC_CLR_PLL_BYPASS_SHIFT      16
#define USBPHY_PLL_SIC_CLR_PLL_BYPASS_WIDTH      1
#define USBPHY_PLL_SIC_CLR_PLL_BYPASS(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_CLR_PLL_BYPASS_SHIFT))&USBPHY_PLL_SIC_CLR_PLL_BYPASS_MASK)
#define USBPHY_PLL_SIC_CLR_PLL_LOCK_MASK         0x80000000u
#define USBPHY_PLL_SIC_CLR_PLL_LOCK_SHIFT        31
#define USBPHY_PLL_SIC_CLR_PLL_LOCK_WIDTH        1
#define USBPHY_PLL_SIC_CLR_PLL_LOCK(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_CLR_PLL_LOCK_SHIFT))&USBPHY_PLL_SIC_CLR_PLL_LOCK_MASK)
/* PLL_SIC_TOG Bit Fields */
#define USBPHY_PLL_SIC_TOG_PLL_DIV_SEL_MASK      0x3u
#define USBPHY_PLL_SIC_TOG_PLL_DIV_SEL_SHIFT     0
#define USBPHY_PLL_SIC_TOG_PLL_DIV_SEL_WIDTH     2
#define USBPHY_PLL_SIC_TOG_PLL_DIV_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_TOG_PLL_DIV_SEL_SHIFT))&USBPHY_PLL_SIC_TOG_PLL_DIV_SEL_MASK)
#define USBPHY_PLL_SIC_TOG_PLL_EN_USB_CLKS_MASK  0x40u
#define USBPHY_PLL_SIC_TOG_PLL_EN_USB_CLKS_SHIFT 6
#define USBPHY_PLL_SIC_TOG_PLL_EN_USB_CLKS_WIDTH 1
#define USBPHY_PLL_SIC_TOG_PLL_EN_USB_CLKS(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_TOG_PLL_EN_USB_CLKS_SHIFT))&USBPHY_PLL_SIC_TOG_PLL_EN_USB_CLKS_MASK)
#define USBPHY_PLL_SIC_TOG_PLL_HOLD_RING_OFF_MASK 0x800u
#define USBPHY_PLL_SIC_TOG_PLL_HOLD_RING_OFF_SHIFT 11
#define USBPHY_PLL_SIC_TOG_PLL_HOLD_RING_OFF_WIDTH 1
#define USBPHY_PLL_SIC_TOG_PLL_HOLD_RING_OFF(x)  (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_TOG_PLL_HOLD_RING_OFF_SHIFT))&USBPHY_PLL_SIC_TOG_PLL_HOLD_RING_OFF_MASK)
#define USBPHY_PLL_SIC_TOG_PLL_POWER_MASK        0x1000u
#define USBPHY_PLL_SIC_TOG_PLL_POWER_SHIFT       12
#define USBPHY_PLL_SIC_TOG_PLL_POWER_WIDTH       1
#define USBPHY_PLL_SIC_TOG_PLL_POWER(x)          (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_TOG_PLL_POWER_SHIFT))&USBPHY_PLL_SIC_TOG_PLL_POWER_MASK)
#define USBPHY_PLL_SIC_TOG_PLL_ENABLE_MASK       0x2000u
#define USBPHY_PLL_SIC_TOG_PLL_ENABLE_SHIFT      13
#define USBPHY_PLL_SIC_TOG_PLL_ENABLE_WIDTH      1
#define USBPHY_PLL_SIC_TOG_PLL_ENABLE(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_TOG_PLL_ENABLE_SHIFT))&USBPHY_PLL_SIC_TOG_PLL_ENABLE_MASK)
#define USBPHY_PLL_SIC_TOG_PLL_BYPASS_MASK       0x10000u
#define USBPHY_PLL_SIC_TOG_PLL_BYPASS_SHIFT      16
#define USBPHY_PLL_SIC_TOG_PLL_BYPASS_WIDTH      1
#define USBPHY_PLL_SIC_TOG_PLL_BYPASS(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_TOG_PLL_BYPASS_SHIFT))&USBPHY_PLL_SIC_TOG_PLL_BYPASS_MASK)
#define USBPHY_PLL_SIC_TOG_PLL_LOCK_MASK         0x80000000u
#define USBPHY_PLL_SIC_TOG_PLL_LOCK_SHIFT        31
#define USBPHY_PLL_SIC_TOG_PLL_LOCK_WIDTH        1
#define USBPHY_PLL_SIC_TOG_PLL_LOCK(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_TOG_PLL_LOCK_SHIFT))&USBPHY_PLL_SIC_TOG_PLL_LOCK_MASK)
/* USB1_VBUS_DETECT Bit Fields */
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH_MASK 0x7u
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH_SHIFT 0
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH_WIDTH 3
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH_SHIFT))&USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH_MASK)
#define USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN_MASK 0x8u
#define USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN_SHIFT 3
#define USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN_SHIFT))&USBPHY_USB1_VBUS_DETECT_VBUS_OVERRIDE_EN_MASK)
#define USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE_MASK 0x10u
#define USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE_SHIFT 4
#define USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_SESSEND_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE_MASK 0x20u
#define USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE_SHIFT 5
#define USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_BVALID_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE_MASK 0x40u
#define USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE_SHIFT 6
#define USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_AVALID_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE_MASK 0x80u
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE_SHIFT 7
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_VBUSVALID_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL_MASK 0x100u
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL_SHIFT 8
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL_SHIFT))&USBPHY_USB1_VBUS_DETECT_VBUSVALID_SEL_MASK)
#define USBPHY_USB1_VBUS_DETECT_VBUS_SOURCE_SEL_MASK 0x600u
#define USBPHY_USB1_VBUS_DETECT_VBUS_SOURCE_SEL_SHIFT 9
#define USBPHY_USB1_VBUS_DETECT_VBUS_SOURCE_SEL_WIDTH 2
#define USBPHY_USB1_VBUS_DETECT_VBUS_SOURCE_SEL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_VBUS_SOURCE_SEL_SHIFT))&USBPHY_USB1_VBUS_DETECT_VBUS_SOURCE_SEL_MASK)
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID_MASK 0x40000u
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID_SHIFT 18
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID_SHIFT))&USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID_MASK)
#define USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_MASK  0x100000u
#define USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_SHIFT 20
#define USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_SHIFT))&USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_MASK)
#define USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS_MASK 0x4000000u
#define USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS_SHIFT 26
#define USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS_SHIFT))&USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS_MASK)
#define USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR_MASK 0x80000000u
#define USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR_SHIFT 31
#define USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR_WIDTH 1
