RT-Thread/rt-thread/bsp/freescale/platform/devices/MK66F18/include/MK66F18.h
#define USBPHY_ANACTRL_CLR_PFD_FRAC(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_PFD_FRAC_SHIFT))&USBPHY_ANACTRL_CLR_PFD_FRAC_MASK)
#define USBPHY_ANACTRL_CLR_DEV_PULLDOWN_MASK     0x400u
#define USBPHY_ANACTRL_CLR_DEV_PULLDOWN_SHIFT    10
#define USBPHY_ANACTRL_CLR_DEV_PULLDOWN_WIDTH    1
#define USBPHY_ANACTRL_CLR_DEV_PULLDOWN(x)       (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_DEV_PULLDOWN_SHIFT))&USBPHY_ANACTRL_CLR_DEV_PULLDOWN_MASK)
#define USBPHY_ANACTRL_CLR_EMPH_PULSE_CTRL_MASK  0x1800u
#define USBPHY_ANACTRL_CLR_EMPH_PULSE_CTRL_SHIFT 11
#define USBPHY_ANACTRL_CLR_EMPH_PULSE_CTRL_WIDTH 2
#define USBPHY_ANACTRL_CLR_EMPH_PULSE_CTRL(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_EMPH_PULSE_CTRL_SHIFT))&USBPHY_ANACTRL_CLR_EMPH_PULSE_CTRL_MASK)
#define USBPHY_ANACTRL_CLR_EMPH_EN_MASK          0x2000u
#define USBPHY_ANACTRL_CLR_EMPH_EN_SHIFT         13
#define USBPHY_ANACTRL_CLR_EMPH_EN_WIDTH         1
#define USBPHY_ANACTRL_CLR_EMPH_EN(x)            (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_EMPH_EN_SHIFT))&USBPHY_ANACTRL_CLR_EMPH_EN_MASK)
#define USBPHY_ANACTRL_CLR_EMPH_CUR_CTRL_MASK    0xC000u
#define USBPHY_ANACTRL_CLR_EMPH_CUR_CTRL_SHIFT   14
#define USBPHY_ANACTRL_CLR_EMPH_CUR_CTRL_WIDTH   2
#define USBPHY_ANACTRL_CLR_EMPH_CUR_CTRL(x)      (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_EMPH_CUR_CTRL_SHIFT))&USBPHY_ANACTRL_CLR_EMPH_CUR_CTRL_MASK)
#define USBPHY_ANACTRL_CLR_PFD_STABLE_MASK       0x80000000u
#define USBPHY_ANACTRL_CLR_PFD_STABLE_SHIFT      31
#define USBPHY_ANACTRL_CLR_PFD_STABLE_WIDTH      1
#define USBPHY_ANACTRL_CLR_PFD_STABLE(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_PFD_STABLE_SHIFT))&USBPHY_ANACTRL_CLR_PFD_STABLE_MASK)
/* ANACTRL_TOG Bit Fields */
#define USBPHY_ANACTRL_TOG_TESTCLK_SEL_MASK      0x1u
#define USBPHY_ANACTRL_TOG_TESTCLK_SEL_SHIFT     0
#define USBPHY_ANACTRL_TOG_TESTCLK_SEL_WIDTH     1
#define USBPHY_ANACTRL_TOG_TESTCLK_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_TESTCLK_SEL_SHIFT))&USBPHY_ANACTRL_TOG_TESTCLK_SEL_MASK)
#define USBPHY_ANACTRL_TOG_PFD_CLKGATE_MASK      0x2u
#define USBPHY_ANACTRL_TOG_PFD_CLKGATE_SHIFT     1
#define USBPHY_ANACTRL_TOG_PFD_CLKGATE_WIDTH     1
#define USBPHY_ANACTRL_TOG_PFD_CLKGATE(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_PFD_CLKGATE_SHIFT))&USBPHY_ANACTRL_TOG_PFD_CLKGATE_MASK)
#define USBPHY_ANACTRL_TOG_PFD_CLK_SEL_MASK      0xCu
#define USBPHY_ANACTRL_TOG_PFD_CLK_SEL_SHIFT     2
#define USBPHY_ANACTRL_TOG_PFD_CLK_SEL_WIDTH     2
#define USBPHY_ANACTRL_TOG_PFD_CLK_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_PFD_CLK_SEL_SHIFT))&USBPHY_ANACTRL_TOG_PFD_CLK_SEL_MASK)
#define USBPHY_ANACTRL_TOG_PFD_FRAC_MASK         0x3F0u
#define USBPHY_ANACTRL_TOG_PFD_FRAC_SHIFT        4
#define USBPHY_ANACTRL_TOG_PFD_FRAC_WIDTH        6
#define USBPHY_ANACTRL_TOG_PFD_FRAC(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_PFD_FRAC_SHIFT))&USBPHY_ANACTRL_TOG_PFD_FRAC_MASK)
#define USBPHY_ANACTRL_TOG_DEV_PULLDOWN_MASK     0x400u
#define USBPHY_ANACTRL_TOG_DEV_PULLDOWN_SHIFT    10
#define USBPHY_ANACTRL_TOG_DEV_PULLDOWN_WIDTH    1
#define USBPHY_ANACTRL_TOG_DEV_PULLDOWN(x)       (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_DEV_PULLDOWN_SHIFT))&USBPHY_ANACTRL_TOG_DEV_PULLDOWN_MASK)
#define USBPHY_ANACTRL_TOG_EMPH_PULSE_CTRL_MASK  0x1800u
#define USBPHY_ANACTRL_TOG_EMPH_PULSE_CTRL_SHIFT 11
#define USBPHY_ANACTRL_TOG_EMPH_PULSE_CTRL_WIDTH 2
#define USBPHY_ANACTRL_TOG_EMPH_PULSE_CTRL(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_EMPH_PULSE_CTRL_SHIFT))&USBPHY_ANACTRL_TOG_EMPH_PULSE_CTRL_MASK)
#define USBPHY_ANACTRL_TOG_EMPH_EN_MASK          0x2000u
#define USBPHY_ANACTRL_TOG_EMPH_EN_SHIFT         13
#define USBPHY_ANACTRL_TOG_EMPH_EN_WIDTH         1
#define USBPHY_ANACTRL_TOG_EMPH_EN(x)            (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_EMPH_EN_SHIFT))&USBPHY_ANACTRL_TOG_EMPH_EN_MASK)
#define USBPHY_ANACTRL_TOG_EMPH_CUR_CTRL_MASK    0xC000u
#define USBPHY_ANACTRL_TOG_EMPH_CUR_CTRL_SHIFT   14
#define USBPHY_ANACTRL_TOG_EMPH_CUR_CTRL_WIDTH   2
#define USBPHY_ANACTRL_TOG_EMPH_CUR_CTRL(x)      (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_EMPH_CUR_CTRL_SHIFT))&USBPHY_ANACTRL_TOG_EMPH_CUR_CTRL_MASK)
#define USBPHY_ANACTRL_TOG_PFD_STABLE_MASK       0x80000000u
#define USBPHY_ANACTRL_TOG_PFD_STABLE_SHIFT      31
#define USBPHY_ANACTRL_TOG_PFD_STABLE_WIDTH      1
#define USBPHY_ANACTRL_TOG_PFD_STABLE(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_PFD_STABLE_SHIFT))&USBPHY_ANACTRL_TOG_PFD_STABLE_MASK)
/* USB1_LOOPBACK Bit Fields */
#define USBPHY_USB1_LOOPBACK_UTMI_TESTSTART_MASK 0x1u
#define USBPHY_USB1_LOOPBACK_UTMI_TESTSTART_SHIFT 0
#define USBPHY_USB1_LOOPBACK_UTMI_TESTSTART_WIDTH 1
#define USBPHY_USB1_LOOPBACK_UTMI_TESTSTART(x)   (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_UTMI_TESTSTART_SHIFT))&USBPHY_USB1_LOOPBACK_UTMI_TESTSTART_MASK)
#define USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0_MASK  0x2u
#define USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0_SHIFT 1
#define USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0_WIDTH 1
#define USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0_SHIFT))&USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0_MASK)
#define USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1_MASK  0x4u
#define USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1_SHIFT 2
#define USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1_WIDTH 1
#define USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1_SHIFT))&USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1_MASK)
#define USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE_MASK 0x8u
#define USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE_SHIFT 3
#define USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE(x)  (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE_SHIFT))&USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE_MASK)
#define USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE_MASK 0x10u
#define USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE_SHIFT 4
#define USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE(x)  (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE_SHIFT))&USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE_MASK)
#define USBPHY_USB1_LOOPBACK_TSTI_TX_EN_MASK     0x20u
#define USBPHY_USB1_LOOPBACK_TSTI_TX_EN_SHIFT    5
#define USBPHY_USB1_LOOPBACK_TSTI_TX_EN_WIDTH    1
#define USBPHY_USB1_LOOPBACK_TSTI_TX_EN(x)       (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TSTI_TX_EN_SHIFT))&USBPHY_USB1_LOOPBACK_TSTI_TX_EN_MASK)
#define USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ_MASK    0x40u
#define USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ_SHIFT   6
#define USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ_WIDTH   1
#define USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ(x)      (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ_SHIFT))&USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ_MASK)
#define USBPHY_USB1_LOOPBACK_UTMO_DIG_TST0_MASK  0x80u
#define USBPHY_USB1_LOOPBACK_UTMO_DIG_TST0_SHIFT 7
#define USBPHY_USB1_LOOPBACK_UTMO_DIG_TST0_WIDTH 1
#define USBPHY_USB1_LOOPBACK_UTMO_DIG_TST0(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_UTMO_DIG_TST0_SHIFT))&USBPHY_USB1_LOOPBACK_UTMO_DIG_TST0_MASK)
#define USBPHY_USB1_LOOPBACK_UTMO_DIG_TST1_MASK  0x100u
#define USBPHY_USB1_LOOPBACK_UTMO_DIG_TST1_SHIFT 8
#define USBPHY_USB1_LOOPBACK_UTMO_DIG_TST1_WIDTH 1
#define USBPHY_USB1_LOOPBACK_UTMO_DIG_TST1(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_UTMO_DIG_TST1_SHIFT))&USBPHY_USB1_LOOPBACK_UTMO_DIG_TST1_MASK)
#define USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN_MASK 0x8000u
#define USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN_SHIFT 15
#define USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN_SHIFT))&USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN_MASK)
#define USBPHY_USB1_LOOPBACK_TSTPKT_MASK         0xFF0000u
#define USBPHY_USB1_LOOPBACK_TSTPKT_SHIFT        16
#define USBPHY_USB1_LOOPBACK_TSTPKT_WIDTH        8
#define USBPHY_USB1_LOOPBACK_TSTPKT(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TSTPKT_SHIFT))&USBPHY_USB1_LOOPBACK_TSTPKT_MASK)
/* USB1_LOOPBACK_SET Bit Fields */
#define USBPHY_USB1_LOOPBACK_SET_UTMI_TESTSTART_MASK 0x1u
#define USBPHY_USB1_LOOPBACK_SET_UTMI_TESTSTART_SHIFT 0
#define USBPHY_USB1_LOOPBACK_SET_UTMI_TESTSTART_WIDTH 1
#define USBPHY_USB1_LOOPBACK_SET_UTMI_TESTSTART(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_SET_UTMI_TESTSTART_SHIFT))&USBPHY_USB1_LOOPBACK_SET_UTMI_TESTSTART_MASK)
#define USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST0_MASK 0x2u
#define USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST0_SHIFT 1
#define USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST0_WIDTH 1
#define USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST0(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST0_SHIFT))&USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST0_MASK)
#define USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST1_MASK 0x4u
#define USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST1_SHIFT 2
#define USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST1_WIDTH 1
#define USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST1(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST1_SHIFT))&USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST1_MASK)
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HS_MODE_MASK 0x8u
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HS_MODE_SHIFT 3
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HS_MODE_WIDTH 1
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HS_MODE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HS_MODE_SHIFT))&USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HS_MODE_MASK)
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_LS_MODE_MASK 0x10u
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_LS_MODE_SHIFT 4
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_LS_MODE_WIDTH 1
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_LS_MODE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_SET_TSTI_TX_LS_MODE_SHIFT))&USBPHY_USB1_LOOPBACK_SET_TSTI_TX_LS_MODE_MASK)
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_EN_MASK 0x20u
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_EN_SHIFT 5
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_EN_WIDTH 1
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_EN(x)   (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_SET_TSTI_TX_EN_SHIFT))&USBPHY_USB1_LOOPBACK_SET_TSTI_TX_EN_MASK)
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HIZ_MASK 0x40u
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HIZ_SHIFT 6
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HIZ_WIDTH 1
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HIZ(x)  (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HIZ_SHIFT))&USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HIZ_MASK)
#define USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST0_MASK 0x80u
#define USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST0_SHIFT 7
#define USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST0_WIDTH 1
#define USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST0(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST0_SHIFT))&USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST0_MASK)
#define USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST1_MASK 0x100u
#define USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST1_SHIFT 8
#define USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST1_WIDTH 1
#define USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST1(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST1_SHIFT))&USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST1_MASK)
#define USBPHY_USB1_LOOPBACK_SET_TSTI_HSFS_MODE_EN_MASK 0x8000u
#define USBPHY_USB1_LOOPBACK_SET_TSTI_HSFS_MODE_EN_SHIFT 15
#define USBPHY_USB1_LOOPBACK_SET_TSTI_HSFS_MODE_EN_WIDTH 1
#define USBPHY_USB1_LOOPBACK_SET_TSTI_HSFS_MODE_EN(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_SET_TSTI_HSFS_MODE_EN_SHIFT))&USBPHY_USB1_LOOPBACK_SET_TSTI_HSFS_MODE_EN_MASK)
#define USBPHY_USB1_LOOPBACK_SET_TSTPKT_MASK     0xFF0000u
#define USBPHY_USB1_LOOPBACK_SET_TSTPKT_SHIFT    16
#define USBPHY_USB1_LOOPBACK_SET_TSTPKT_WIDTH    8
#define USBPHY_USB1_LOOPBACK_SET_TSTPKT(x)       (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_SET_TSTPKT_SHIFT))&USBPHY_USB1_LOOPBACK_SET_TSTPKT_MASK)
/* USB1_LOOPBACK_CLR Bit Fields */
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_TESTSTART_MASK 0x1u
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_TESTSTART_SHIFT 0
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_TESTSTART_WIDTH 1
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_TESTSTART(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_CLR_UTMI_TESTSTART_SHIFT))&USBPHY_USB1_LOOPBACK_CLR_UTMI_TESTSTART_MASK)
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST0_MASK 0x2u
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST0_SHIFT 1
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST0_WIDTH 1
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST0(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST0_SHIFT))&USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST0_MASK)
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST1_MASK 0x4u
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST1_SHIFT 2
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST1_WIDTH 1
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST1(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST1_SHIFT))&USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST1_MASK)
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HS_MODE_MASK 0x8u
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HS_MODE_SHIFT 3
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HS_MODE_WIDTH 1
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HS_MODE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HS_MODE_SHIFT))&USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HS_MODE_MASK)
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_LS_MODE_MASK 0x10u
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_LS_MODE_SHIFT 4
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_LS_MODE_WIDTH 1
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_LS_MODE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_LS_MODE_SHIFT))&USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_LS_MODE_MASK)
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_EN_MASK 0x20u
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_EN_SHIFT 5
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_EN_WIDTH 1
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_EN(x)   (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_EN_SHIFT))&USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_EN_MASK)
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HIZ_MASK 0x40u
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HIZ_SHIFT 6
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HIZ_WIDTH 1
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HIZ(x)  (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HIZ_SHIFT))&USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HIZ_MASK)
#define USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST0_MASK 0x80u
#define USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST0_SHIFT 7
#define USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST0_WIDTH 1
#define USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST0(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST0_SHIFT))&USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST0_MASK)
#define USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST1_MASK 0x100u
#define USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST1_SHIFT 8
#define USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST1_WIDTH 1
#define USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST1(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST1_SHIFT))&USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST1_MASK)
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_HSFS_MODE_EN_MASK 0x8000u
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_HSFS_MODE_EN_SHIFT 15
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_HSFS_MODE_EN_WIDTH 1
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_HSFS_MODE_EN(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_CLR_TSTI_HSFS_MODE_EN_SHIFT))&USBPHY_USB1_LOOPBACK_CLR_TSTI_HSFS_MODE_EN_MASK)
#define USBPHY_USB1_LOOPBACK_CLR_TSTPKT_MASK     0xFF0000u
#define USBPHY_USB1_LOOPBACK_CLR_TSTPKT_SHIFT    16
#define USBPHY_USB1_LOOPBACK_CLR_TSTPKT_WIDTH    8
#define USBPHY_USB1_LOOPBACK_CLR_TSTPKT(x)       (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_CLR_TSTPKT_SHIFT))&USBPHY_USB1_LOOPBACK_CLR_TSTPKT_MASK)
/* USB1_LOOPBACK_TOG Bit Fields */
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_TESTSTART_MASK 0x1u
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_TESTSTART_SHIFT 0
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_TESTSTART_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_TESTSTART(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TOG_UTMI_TESTSTART_SHIFT))&USBPHY_USB1_LOOPBACK_TOG_UTMI_TESTSTART_MASK)
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST0_MASK 0x2u
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST0_SHIFT 1
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST0_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST0(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST0_SHIFT))&USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST0_MASK)
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST1_MASK 0x4u
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST1_SHIFT 2
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST1_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST1(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST1_SHIFT))&USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST1_MASK)
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HS_MODE_MASK 0x8u
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HS_MODE_SHIFT 3
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HS_MODE_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HS_MODE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HS_MODE_SHIFT))&USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HS_MODE_MASK)
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_LS_MODE_MASK 0x10u
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_LS_MODE_SHIFT 4
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_LS_MODE_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_LS_MODE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_LS_MODE_SHIFT))&USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_LS_MODE_MASK)
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_EN_MASK 0x20u
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_EN_SHIFT 5
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_EN_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_EN(x)   (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_EN_SHIFT))&USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_EN_MASK)
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HIZ_MASK 0x40u
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HIZ_SHIFT 6
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HIZ_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HIZ(x)  (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HIZ_SHIFT))&USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HIZ_MASK)
#define USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST0_MASK 0x80u
#define USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST0_SHIFT 7
#define USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST0_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST0(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST0_SHIFT))&USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST0_MASK)
#define USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST1_MASK 0x100u
#define USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST1_SHIFT 8
#define USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST1_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST1(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST1_SHIFT))&USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST1_MASK)
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_HSFS_MODE_EN_MASK 0x8000u
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_HSFS_MODE_EN_SHIFT 15
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_HSFS_MODE_EN_WIDTH 1
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_HSFS_MODE_EN(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TOG_TSTI_HSFS_MODE_EN_SHIFT))&USBPHY_USB1_LOOPBACK_TOG_TSTI_HSFS_MODE_EN_MASK)
#define USBPHY_USB1_LOOPBACK_TOG_TSTPKT_MASK     0xFF0000u
#define USBPHY_USB1_LOOPBACK_TOG_TSTPKT_SHIFT    16
#define USBPHY_USB1_LOOPBACK_TOG_TSTPKT_WIDTH    8
#define USBPHY_USB1_LOOPBACK_TOG_TSTPKT(x)       (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TOG_TSTPKT_SHIFT))&USBPHY_USB1_LOOPBACK_TOG_TSTPKT_MASK)
/* USB1_LOOPBACK_HSFSCNT Bit Fields */
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER_MASK 0xFFFFu
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER_SHIFT 0
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER_WIDTH 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER_MASK)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER_MASK 0xFFFF0000u
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER_SHIFT 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER_WIDTH 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER_MASK)
/* USB1_LOOPBACK_HSFSCNT_SET Bit Fields */
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_HS_NUMBER_MASK 0xFFFFu
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_HS_NUMBER_SHIFT 0
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_HS_NUMBER_WIDTH 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_HS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_HS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_HS_NUMBER_MASK)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_FS_NUMBER_MASK 0xFFFF0000u
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_FS_NUMBER_SHIFT 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_FS_NUMBER_WIDTH 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_FS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_FS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_FS_NUMBER_MASK)
/* USB1_LOOPBACK_HSFSCNT_CLR Bit Fields */
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_HS_NUMBER_MASK 0xFFFFu
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_HS_NUMBER_SHIFT 0
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_HS_NUMBER_WIDTH 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_HS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_HS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_HS_NUMBER_MASK)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_FS_NUMBER_MASK 0xFFFF0000u
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_FS_NUMBER_SHIFT 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_FS_NUMBER_WIDTH 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_FS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_FS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_FS_NUMBER_MASK)
/* USB1_LOOPBACK_HSFSCNT_TOG Bit Fields */
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_HS_NUMBER_MASK 0xFFFFu
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_HS_NUMBER_SHIFT 0
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_HS_NUMBER_WIDTH 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_HS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_HS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_HS_NUMBER_MASK)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_FS_NUMBER_MASK 0xFFFF0000u
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_FS_NUMBER_SHIFT 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_FS_NUMBER_WIDTH 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_FS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_FS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_FS_NUMBER_MASK)
/* TRIM_OVERRIDE_EN Bit Fields */
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE_MASK 0x1u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE_SHIFT 0
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE_WIDTH 1
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_MASK 0x2u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_SHIFT 1
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_WIDTH 1
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE_MASK 0x4u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE_SHIFT 2
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE_WIDTH 1
